package gr.aueb.cf.revision;

import static java.lang.Math.abs;

/**
 * Δύο βάτραχοι προσπαθούν να πιάσουν μία αράχνη.
 * Γράψτε μία μέθοδο που παίρνει ως είσοδο τρεις ακεραίους που αντιπροσωπεύουν
 * τη θέση του κάθε βάτραχου καθώς και τη θέση της αράχνης.Η διαφορά μεταξύ τον θέσεων δίνει την απόσταση
 * μεταξύ του κάθε βάτραχου και της αράχνης. Αν ο 1ος βάτραχος πιάσει την αράχνη, τότε εκτυπώστε μήνυμα «Βάτραχος 1»,
 * αν ο 2ος βάτραχος πιάσει την αράχνη, τότε εκτυπώστε μήνυμα του «Βάτραχος 2», αν και οι δύο βάτραχοι φτάσουν
 * την ίδια στιγμή εκτυπώστε «Αράχνη». Για παράδειγμα αν το input είναι 2 3 4 τότε εκτυπώνει «Βάτραχος 2».
 * Αν είναι 5 7 6 τότε εκτυπώνει «Αράχνη».Σας δίνεται ένας δισδιάστατος πίνακας όπου η κάθε γραμμή είναι 3 αριθμοί
 * όπως παραπάνω και θα πρέπει να εκτυπώσετε μία απάντηση για κάθε περίπτωση.
 *
 */
public class FrogsSpider {

    public static void main(String[] args) {
        int [][] arr = {
            {2, 4, 9},
            {7, 5, 4},
            {9, 8, 11},
            {11, 11, 6}
        };

        for (int i = 0; i <= arr.length - 1; i++){
            whoOfThem(arr[i][0], arr[i][1], arr[i][2]);
        }

    }
    public static void whoOfThem(int f1, int f2, int sp){
        int distanceF1Sp = abs(f1 - sp);
        int distanceF2Sp = abs(f2 - sp);

        if (distanceF1Sp < distanceF2Sp) System.out.println("Βάτραχος 1");
        else if (distanceF2Sp < distanceF1Sp) System.out.println("Βάτραχος 2");
        else System.out.println("Αράχνη");
    }
}

